# -*- coding: utf-8 -*-
# @Author: JimZhang
# @Date:   2020-02-05 09:58:17
# @Last Modified by:   JimZhang
# @Last Modified time: 2020-02-07 01:00:41

ChangeLog = {
	"1.0.35" : {
		"time" : "2020-06-02 09:50:40",
		"log" : """
			fix:
				修复不兼容旧版本的依赖配置而导致的报错问题。
		""",
	},
	"1.0.34" : {
		"time" : "2020-06-01 22:32:45",
		"log" : """
			refactor:
				新增依赖模块版本配置功能；
				新增工具所依赖模块版本校验、安装及卸载功能。
		""",
	},
	"1.0.33" : {
		"time" : "2020-03-11 22:26:41",
		"log" : """
			refactor:
				更新安装依赖模块逻辑实现。
		""",
	},
	"1.0.32" : {
		"time" : "2020-03-11 01:13:30",
		"log" : """
			fix:
				修复升级pip报错问题。
		""",
	},
	"1.0.31" : {
		"time" : "2020-03-10 22:09:54",
		"log" : """
			refactor:
				新增pip升级逻辑；
				更新创建工具模板的逻辑。
		""",
	},
	"1.0.30" : {
		"time" : "2020-03-08 21:35:32",
		"log" : """
			refactor:
				更新平台图标；
				更新路径输入控件；
				更新缓存管理功能；
				更新工具模板；
				修改平台资源位。
			fix:修复工具相关若干bug。
		""",
	},
	"1.0.19" : {
		"time" : "2020-02-07 00:59:12",
		"log" : """
			feat:新增标签页数限制功能。
			refactor:修复工具树右键菜单异常问题。
		""",
	},
	"1.0.18" : {
		"time" : "2020-02-05 21:20:00",
		"log" : """
			refactor:
				更新登录弹窗逻辑及界面；
				启用退出平台菜单项。
		""",
	},
	"1.0.17" : {
		"time" : "2020-02-05 20:09:49",
		"log" : """
			fix: 修复登录平台报错问题。
		""",
	},
	"1.0.16" : {
		"time" : "2020-02-04 23:43:40",
		"log" : """
			feat: 新增校验更新目录功能。
		""",
	},
};