# -*- coding: utf-8 -*-
# @Author: JimZhang
# @Date:   2020-02-05 09:58:17
# @Last Modified by:   JimZhang
# @Last Modified time: 2020-02-07 01:00:41

ChangeLog = {
	"1.0.30" : {
		"time" : "2020-03-08 21:35:32",
		"log" : """
			refactor:
				更新平台图标；
				更新路径输入控件；
				更新缓存管理功能；
				更新工具模板；
				修改平台资源位。
			fix:修复工具相关若干bug。
		""",
	},
	"1.0.19" : {
		"time" : "2020-02-07 00:59:12",
		"log" : """
			feat:新增标签页数限制功能。
			refactor:修复工具树右键菜单异常问题。
		""",
	},
	"1.0.18" : {
		"time" : "2020-02-05 21:20:00",
		"log" : """
			refactor:
				更新登录弹窗逻辑及界面；
				启用退出平台菜单项。
		""",
	},
	"1.0.17" : {
		"time" : "2020-02-05 20:09:49",
		"log" : """
			fix: 修复登录平台报错问题。
		""",
	},
	"1.0.16" : {
		"time" : "2020-02-04 23:43:40",
		"log" : """
			feat: 新增校验更新目录功能。
		""",
	},
};